Revit 2027 API
BuiltInFailures.RegenFailures.UserCancelled Property
 Operation is cancelled by the user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UserCancelled { get; }
Public Shared ReadOnly Property UserCancelled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UserCancelled {
	FailureDefinitionId^ get ();
}
static member UserCancelled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace